INSERT INTO genres(genre) VALUES
('Рок'),
('Реп'),
('Попса');

INSERT INTO executors(executor) VALUES
('Ария'),
('Eminem'),
('Филипп Киркоров'),
('Егор Крид'),
('Тимати'),
('Олег Газманов'),
('Эпидемия'),
('Слот');

INSERT INTO genres_artists(genre_id, executor_id) VALUES
('1', '1'),
('2', '2'),
('3', '3'),
('2', '3'),
('2', '4'),
('3', '4'),
('2', '5'),
('3', '5'),
('3', '6'),
('1', '7'),
('1', '8'),
('2', '8');

INSERT INTO albums(album, year_of_release) VALUES
('Испытание огем', '2005'),
('The Eminem Show', '2007'),
('Примадонна', '2009'),
('Невеста', '2016'),
('Чёрный лейбл', '2018'),
('Русь', '2015'),
('Всадник', '2014'),
('От заката до рассвета', '2019');

INSERT INTO albums_artists(executor_id, album_id) VALUES
('1', '1'),
('2', '2'),
('3', '3'),
('4', '4'),
('5', '5'),
('3', '5'),
('4', '5'),
('6', '6'),
('7', '7'),
('8', '8'),
('5', '4'),
('1', '7'),
('7', '1');

INSERT INTO songs(song, duration, album_id) VALUES
('Штиль', '00:05:35', '1'),
('Dangerous lane', '00:05:15', '2'),
('Цвет настроения чёрный', '00:04:12', '5'),
('Звездопад', '00:03:30', '5'),
('Плачут небеса', '00:04:01', '4'),
('Вороны', '00:05:02', '6'),
('Я молился на тебя', '00:06:12', '7'),
('Кома', '00:03:48', '8');

INSERT INTO collections(album, year_of_release) VALUES
('Мы на хайпе', '2018'),
('Провожаем 21', '2021'),
('Ушёл красиво', '2018'),
('Медляк под металл', '2016');

INSERT INTO collection_songs(song_id, collection_id) VALUES
('3', '1'),
('4', '2'),
('5', '3'),
('7', '4');